[
  {
    "id": 1,
    "emotion": "anxiety",
    "verse": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.",
    "reference": "Philippians 4:6-7",
    "explanation": "This verse reminds us to replace anxiety with prayer, turning our worries into conversations with God who promises a peace beyond our understanding."
  },
  {
    "id": 2,
    "emotion": "anxiety",
    "verse": "Cast all your anxiety on him because he cares for you.",
    "reference": "1 Peter 5:7",
    "explanation": "A powerful reminder that God invites us to hand over every worry — not because they don't matter, but because He deeply cares about what burdens us."
  },
  {
    "id": 3,
    "emotion": "anxiety",
    "verse": "When anxiety was great within me, your consolation brought me joy.",
    "reference": "Psalm 94:19",
    "explanation": "Even in overwhelming anxiety, God's comfort has the power to bring unexpected joy — a promise from someone who has experienced it firsthand."
  },
  {
    "id": 4,
    "emotion": "sadness",
    "verse": "The Lord is close to the brokenhearted and saves those who are crushed in spirit.",
    "reference": "Psalm 34:18",
    "explanation": "In your deepest sadness, God doesn't stand far away — He draws closer. This verse assures us that brokenness attracts His presence, not His distance."
  },
  {
    "id": 5,
    "emotion": "sadness",
    "verse": "He heals the brokenhearted and binds up their wounds.",
    "reference": "Psalm 147:3",
    "explanation": "God is described as a gentle healer who personally tends to emotional wounds — binding them up like a caring physician treats an injury."
  },
  {
    "id": 6,
    "emotion": "sadness",
    "verse": "Weeping may stay for the night, but rejoicing comes in the morning.",
    "reference": "Psalm 30:5",
    "explanation": "Sadness is real but temporary. This verse promises that seasons of tears give way to seasons of joy — the night always ends in morning."
  },
  {
    "id": 7,
    "emotion": "joy",
    "verse": "Rejoice in the Lord always. I will say it again: Rejoice!",
    "reference": "Philippians 4:4",
    "explanation": "Joy in God isn't dependent on circumstances — it's a choice we can make in every season. Paul repeats it for emphasis: this joy is always available."
  },
  {
    "id": 8,
    "emotion": "joy",
    "verse": "The joy of the Lord is your strength.",
    "reference": "Nehemiah 8:10",
    "explanation": "True joy isn't just a feeling — it's a source of strength. When we find our joy in God, it becomes an unshakable foundation that sustains us."
  },
  {
    "id": 9,
    "emotion": "joy",
    "verse": "You make known to me the path of life; you will fill me with joy in your presence, with eternal pleasures at your right hand.",
    "reference": "Psalm 16:11",
    "explanation": "The deepest joy is found in God's presence. This verse points to a joy that isn't fleeting but eternal — rooted in relationship with the Creator."
  },
  {
    "id": 10,
    "emotion": "loneliness",
    "verse": "The Lord himself goes before you and will be with you; he will never leave you nor forsake you. Do not be afraid; do not be discouraged.",
    "reference": "Deuteronomy 31:8",
    "explanation": "When loneliness whispers that you're abandoned, this verse declares the opposite — God goes ahead of you and stays beside you. You are never truly alone."
  },
  {
    "id": 11,
    "emotion": "loneliness",
    "verse": "God sets the lonely in families, he leads out the prisoners with singing.",
    "reference": "Psalm 68:6",
    "explanation": "God sees loneliness and actively works against it — placing people in communities and turning isolation into belonging and celebration."
  },
  {
    "id": 12,
    "emotion": "loneliness",
    "verse": "Turn to me and be gracious to me, for I am lonely and afflicted.",
    "reference": "Psalm 25:16",
    "explanation": "David honestly tells God about his loneliness — showing us that bringing our pain directly to God is not weakness but faith in action."
  },
  {
    "id": 13,
    "emotion": "anger",
    "verse": "In your anger do not sin: Do not let the sun go down while you are still angry.",
    "reference": "Ephesians 4:26",
    "explanation": "Anger itself isn't condemned — but holding onto it is dangerous. This verse gives practical wisdom: process your anger before the day ends."
  },
  {
    "id": 14,
    "emotion": "anger",
    "verse": "A gentle answer turns away wrath, but a harsh word stirs up anger.",
    "reference": "Proverbs 15:1",
    "explanation": "When anger rises, our response determines what happens next. Gentleness has the surprising power to de-escalate, while harshness only adds fuel."
  },
  {
    "id": 15,
    "emotion": "anger",
    "verse": "My dear brothers and sisters, take note of this: Everyone should be quick to listen, slow to speak and slow to become angry.",
    "reference": "James 1:19",
    "explanation": "A practical framework for managing anger: listen first, speak carefully, and let anger be your last response — not your first."
  },
  {
    "id": 16,
    "emotion": "gratitude",
    "verse": "Give thanks in all circumstances; for this is God's will for you in Christ Jesus.",
    "reference": "1 Thessalonians 5:18",
    "explanation": "Gratitude isn't reserved for good times — it's a practice for all circumstances. This verse reveals that thankfulness is central to God's desire for our lives."
  },
  {
    "id": 17,
    "emotion": "gratitude",
    "verse": "Every good and perfect gift is from above, coming down from the Father of the heavenly lights.",
    "reference": "James 1:17",
    "explanation": "Every blessing in your life traces back to God — recognizing this transforms ordinary moments into reasons for deep gratitude."
  },
  {
    "id": 18,
    "emotion": "gratitude",
    "verse": "Enter his gates with thanksgiving and his courts with praise; give thanks to him and praise his name.",
    "reference": "Psalm 100:4",
    "explanation": "Gratitude is the doorway into God's presence. When we approach Him with thankfulness, we step into a deeper experience of who He is."
  }
]
